Dolomonti/ESP32s3-Lawnmower/src/main.cpp
//Buffer Synchronization with Mutex: Synchronize shared buffers using a mutex to avoid data corruption
SemaphoreHandle_t bufferMutex = xSemaphoreCreateMutex();
// In der Nähe Ihrer anderen Mutex-Deklarationen
SemaphoreHandle_t i2cMutex;



// Example: a function to clear skill states
void deactivateSkill() {
    skillActive    = false;
    currentSkill   = 0;
    skillSteer     = 0;
    monitorDirection = false; // or holdLine/holdPosition, as needed
}

void checkWebSocketConnection() {
    ws.cleanupClients();
}

void checkPeerTimeout() {
    unsigned long currentMillis = millis();
    for (int i = 0; i < numberOfPeers; i++) {
        // Wenn verbunden, aber seit peerTimeout (15s) nichts mehr gehört -> offline setzen
        if (peers[i].isConnected && (currentMillis - peers[i].lastSeen > peerTimeout)) {
            peers[i].isConnected = false;
            if (ENABLE_DEBUG_SERIAL) {
                debugPrintf("Peer %d marked OFFLINE (Timeout)\n", deviceList[i].id);
            }
        }
    }
}

void readWiFiCredentialsFromEEPROM() {
    for (int i = 0; i < 32; i++) {
        stored_ssid[i] = char(EEPROM.read(SSID_ADDR + i));
        stored_password[i] = char(EEPROM.read(PASSWORD_ADDR + i));
    }
}


void writeWiFiCredentialsToEEPROM(const char *ssid, const char *password) {
    // Schreiben Sie die SSID- und Passwort-Zeichenfolgen in den EEPROM.
    // Wenn die Zeichenfolge kürzer als 32 Zeichen ist, wird der Rest mit Nullen (0) aufgefüllt.
    for (int i = 0; i < 32; i++) {
        EEPROM.write(SSID_ADDR + i, i < strlen(ssid) ? ssid[i] : 0);
        EEPROM.write(PASSWORD_ADDR + i, i < strlen(password) ? password[i] : 0);
    }
    
    // Übertragen Sie die Änderungen in den permanenten Speicher und überprüfen Sie den Erfolg.
    if (EEPROM.commit()) {
        if (ENABLE_DEBUG_SERIAL) {
          debugPrintln("WiFi credentials successfully saved to EEPROM.");
          logToWebpage("WiFi credentials saved."); // Informiert auch die Webseite
        }
    } else {
        if (ENABLE_DEBUG_SERIAL) {
          debugPrintln("ERROR: Failed to save WiFi credentials to EEPROM.");
          logToWebpage("Error: Failed to save WiFi credentials."); // Informiert die Webseite über den Fehler
        }
    }
}

// CORRECTED FUNCTION SIGNATURE for ESP-IDF version in Arduino Core 2.0.x
void OnDataSent(const uint8_t *mac_addr, esp_now_send_status_t status) {
    // This function is the callback for ESP-NOW send operations.
    // debugPrint("Packet sent. Status: ");
    // debugPrintln(status == ESP_NOW_SEND_SUCCESS ? "Success" : "Fail");
}


// REVISED PEER MANAGEMENT LOGIC
void managePeers() {
    unsigned long currentMillis = millis();

    if (xSemaphoreTake(espNowMutex, (TickType_t)50) != pdTRUE) {
        return; // Could not get mutex, try again later
    }

    for (int i = 0; i < numberOfPeers; i++) {
        // >>> FIX 1: Skip trying to manage our own MAC address
        if (deviceList[i].id == deviceID) {
            continue;
        }

        // 1. Check for timeout if currently connected
        if (peers[i].isConnected && (currentMillis - peers[i].lastSeen > peerTimeout)) {
            peers[i].isConnected = false;
            peers[i].reconnectAttempts = 0; // Reset attempts on disconnect
            if (ENABLE_DEBUG_SERIAL) {
                debugPrintf("Peer %d timed out.\n", deviceList[i].id);
            }
        }

        // 2. Attempt to reconnect (Status-Update ohne Re-Init)
        if (!peers[i].isConnected) {
            if (currentMillis - peers[i].lastReconnectAttempt > reconnectInterval) {
                peers[i].lastReconnectAttempt = currentMillis;
                // Wir löschen den Peer NICHT mehr. ESP-NOW merkt von selbst, 
                // wenn das Gerät wieder in Reichweite ist und sendet.
                if (ENABLE_DEBUG_SERIAL && peers[i].reconnectAttempts == 0) {
                    debugPrintf("Peer %d marked as OFFLINE. Waiting for signal...\n", deviceList[i].id);
                    peers[i].reconnectAttempts = 1; // Nur einmal loggen
                }
            }
        }
    }
    xSemaphoreGive(espNowMutex);
}


void printOwnMacAddress() {
    String mac = WiFi.macAddress();
    if (ENABLE_DEBUG_SERIAL) {
      debugPrint("ESP32 MAC Address: ");
      debugPrintln(mac);
    }
}

/**
 * @brief Saves the current settings structure AND a CRC32 checksum to EEPROM.
 */
void saveSettings() {
    // 1. Berechne den CRC32 der Einstellungs-Struktur
    uint32_t calculated_crc = esp_crc32_le(0, (uint8_t*)&currentSettings, sizeof(Settings));

    // 2. Schreibe die Struktur an ihre Adresse
    EEPROM.put(SETTINGS_ADDR, currentSettings);
    
    // 3. Schreibe den berechneten CRC direkt HINTER die Struktur
    EEPROM.put(SETTINGS_ADDR + sizeof(Settings), calculated_crc);

    // 4. Änderungen bestätigen
    if (EEPROM.commit()) {
        if (ENABLE_DEBUG_SERIAL) {
            debugPrintln("Settings and CRC successfully saved to EEPROM.");
        }
    } else {
        if (ENABLE_DEBUG_SERIAL) {
            debugPrintln("Error saving settings to EEPROM.");
        }
    }
}
/**
 * @brief Loads settings from EEPROM or initializes with defaults if CRC check fails.
 */

void loadSettings() {
    // 1. Lade die Einstellungs-Struktur
    EEPROM.get(SETTINGS_ADDR, currentSettings);

    // 2. Lade den gespeicherten CRC (der direkt dahinter liegt)
    uint32_t saved_crc;
    EEPROM.get(SETTINGS_ADDR + sizeof(Settings), saved_crc);

    // 3. Berechne den CRC der Struktur, die wir gerade geladen haben
    uint32_t calculated_crc = esp_crc32_le(0, (uint8_t*)&currentSettings, sizeof(Settings));

    // 4. Vergleiche den gespeicherten CRC mit dem neu berechneten CRC.
    if (calculated_crc != saved_crc || currentSettings.magic != 0xDEADBEEF) {
        
        if (ENABLE_DEBUG_SERIAL) {
            debugPrintln("EEPROM data invalid or CRC mismatch! Loading defaults.");
        }

        // --- Set Default Values --- 
        currentSettings.magic = 0xDEADBEEF; 

        // Drive System Defaults
        currentSettings.driveBatteryFactor = 1.0; // Korrekturwert für 37.0V
        currentSettings.driveMinShutdownVoltage = 3100;
        currentSettings.driveSafetyModeVoltage = 3250;
        currentSettings.driveHighVoltage = 4300;
        currentSettings.driveEmergencyLowTemp = 200;
        currentSettings.driveSafetyModeTemp = 1000;
        currentSettings.driveHighTemp = 5000;

