Dolomonti/ESP32s3-Lawnmower/src/main.cpp
        // Blade System Defaults
        currentSettings.bladeBatteryFactor = 6.40; // Korrekturwert für 14.84V
        currentSettings.bladeMinShutdownVoltage = 1200;
        currentSettings.bladeSafetyModeVoltage = 1300;
        currentSettings.bladeHighVoltage = 1680;
        currentSettings.bladeEmergencyLowTemp = 500;
        currentSettings.bladeSafetyModeTemp = 1000;
        currentSettings.bladeHighTemp = 5000;

        // Speed & Steer Defaults
        currentSettings.maxSpeed = MAX_SPEED;
        currentSettings.maxSteer = MAX_STEER;
        currentSettings.currentMaxSpeed = 200;
        currentSettings.currentMaxSteer = 200;

        // Blade Speeds & Reset Timing
        currentSettings.bladeWorkingSpeed = 1600;
        currentSettings.bladeStage2Speed = 1700;
        currentSettings.bladeMaxSpeed = 1800;
        currentSettings.bladeCableResetRpm = 1800;
        currentSettings.bladeResetRampS = 3;      
        currentSettings.bladeResetDurationS = 1;  

        // Capsize Settings
        currentSettings.capsizeAngle = 60.0;
        currentSettings.capsizeTimeout = 1500;

        // PD-Gains
        currentSettings.Kp = 4.0;
        currentSettings.Kd = 1.5;

        currentSettings.apiKey[0] = '\0'; // Init API Key empty

        // Speichere die neuen Standardwerte
        saveSettings();
    } else {
        if (ENABLE_DEBUG_SERIAL) {
            debugPrintln("Successfully loaded settings from EEPROM (CRC OK).");
        }
    }
}


/////////////////////////TRIGGER SKILLS Logic//////////////////////////////////////////////

void triggerSkill(uint8_t skill, int16_t param1 = 0, int16_t param2 = 0, int16_t param3 = 0, int16_t param4 = 0, int16_t param5 = 0, int16_t param6 = 0) {

    switch (skill) {

        // ---------------------------------------------------------------------
        // Skill 0: Undefined
        // ---------------------------------------------------------------------
        case 0:
            if (ENABLE_DEBUG_SERIAL) {
                debugPrintln("Skill 0: undefined placeholder.");
            }
            break;

        // ---------------------------------------------------------------------
        // Skill 1: Full System Stop & Reset (The "Stop/Reset" button)
        // ---------------------------------------------------------------------
        case 1:
            if (ENABLE_DEBUG_SERIAL) {
                debugPrintln("Skill 1: Full System Stop & Reset Triggered.");
            }
            // 1. Stop any active skill (turning, hold line, etc.)
            resetAll();

            // 2. Reset gyro horizon to current position
            resetHorizon();

            // 3. Clear any emergency stop state
            if (skill8SafetyActive) {
                skill8SafetyActive = false;
                if (ENABLE_DEBUG_SERIAL) {
                    debugPrintln("--> Emergency Stop cleared by reset.");
                }
            }

            // 4. Ensure capsize monitoring is active again
            if (!skill8Active) {
                skill8Active = true;
                if (ENABLE_DEBUG_SERIAL) {
                    debugPrintln("--> Capsize monitoring (Skill 8) reactivated by reset.");
                }
            }
            hoverboardInverted = false; // Also reset the capsize detection flag
            break;

        // ---------------------------------------------------------------------
        // Skill 2: 90-degree turn
        // ---------------------------------------------------------------------
        case 2:
            if (!skill8Active) {
                debugPrintln("Skill 2 cannot be activated: Capsize protection (Skill 8) is not active.");
                break;
            }
            resetAll();
            resetHorizon();
            
            // FIX: Geschwindigkeit nullen, damit er nicht mit altem Speed in die Kurve schießt
            lastEspNowSpeed = 0; 

            skillActive = true;
            currentCase = 2;

            if (param1 > 0) {
                targetAngle = + 90.0;
                turnDirection = 1;
                if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 2: 90-degree turn RIGHT triggered!");
            } else if (param1 < 0) {
                targetAngle = - 90.0;
                turnDirection = -1;
                if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 2: 90-degree turn LEFT triggered!");
            }
            
            if (targetAngle > 180) targetAngle -= 360;
            if (targetAngle < -180) targetAngle += 360;

            monitorDirection = true;
            break;

        // ---------------------------------------------------------------------
        // Skill 4: 180-degree turn
        // ---------------------------------------------------------------------
        case 4:
            if (!skill8Active) {
                debugPrintln("Skill 4 cannot be activated: Capsize protection (Skill 8) is not active.");
                break;
            }
            resetAll();
            resetHorizon();
            
            // FIX: Geschwindigkeit nullen
            lastEspNowSpeed = 0; 

            skillActive = true;
            currentCase = 4;

            if (param1 > 0) {
                targetAngle = + 180.0;
                turnDirection = 1;
                if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 4: 180-degree turn RIGHT triggered!");
            } else if (param1 < 0) {
                targetAngle = - 180.0;
                turnDirection = -1;
                if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 4: 180-degree turn LEFT triggered!");
            }

            if (targetAngle > 180) targetAngle -= 360;
            if (targetAngle < -180) targetAngle += 360;

            monitorDirection = true;
            break;

        // ---------------------------------------------------------------------
        // Skill 3: Holding the line
        // ---------------------------------------------------------------------
        case 3:
            if (!skill8Active) {
                debugPrintln("Skill 3 cannot be activated: Capsize protection (Skill 8) is not active.");
                break;
            }
            if (holdLine) {
                resetAll();
                if (ENABLE_DEBUG_SERIAL) {
                    debugPrintln("Skill 3: Deactivated (no longer holding the line).");
                }
            } else {
                resetAll();
                holdLine = true;
                skillActive = true;
                currentCase = 3;
                resetHorizon();
                startYaw = yaw;
                case3StartTime = millis();
                if (ENABLE_DEBUG_SERIAL) {
                    debugPrintln("Skill 3: Activated (holding the line).");
                }
            }
            break;

        

        // ---------------------------------------------------------------------
        // Skill 5: Blade position
        // ---------------------------------------------------------------------
        case 5:
            if (param1 > 0) {
                // Move blade UP
                digitalWrite(BLADE_DOWN_PIN, LOW); 
                digitalWrite(BLADE_UP_PIN, HIGH);
                currentBladeHeight = BLADE_HEIGHT_UP;

