Dolomonti/ESP32s3-Lawnmower/src/main.cpp
                // Safety: when blade is up, always force motor OFF
                currentBladeState = BLADE_OFF;
                digitalWrite(BLADE_UNIT_PIN, LOW);
                bladeEsc.writeMicroseconds(BLADE_ZERO_US);

                if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 5: Blade UP (Pin 35 HIGH) - forcing Blade OFF for safety.");
            }
            else if (param1 < 0) {
                // Move blade DOWN
                digitalWrite(BLADE_UP_PIN, LOW);
                digitalWrite(BLADE_DOWN_PIN, HIGH);
                currentBladeHeight = BLADE_HEIGHT_DOWN;
                if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 5: Blade DOWN (Pin 36 HIGH).");
            }
            else {
                // Stop blade movement - keep last known height state
                digitalWrite(BLADE_UP_PIN, LOW);
                digitalWrite(BLADE_DOWN_PIN, LOW);
                if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 5: Blade Height STOP (Pins LOW).");
            }
            break; 


    // ---------------------------------------------------------------------
        // Skill 6: Blade Control
        // ---------------------------------------------------------------------
        case 6:
        { 
            // Wir casten param1 zu uint16_t, um den Überlauf der 90k Kennung 
            // der Website mathematisch präzise abzufangen.
            uint16_t rawKey = (uint16_t)param1; 
            int16_t key = (int16_t)param1;

            // Helper: check if blade is allowed to run
            auto bladeAllowed = []() -> bool {
                return (currentBladeHeight == BLADE_HEIGHT_DOWN);
            };

            // A: Blade AUS
            if (key == -1) { 
                currentBladeState = BLADE_OFF;
                digitalWrite(BLADE_UNIT_PIN, LOW); // Pin 19 aus
                current_blade_pwm = BLADE_ZERO_US;
                if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 6: Blade Unit OFF (Pin 19 LOW)");
            }
            // B: Blade Stand-by (only if blade is DOWN)
            else if (key == 1) {
                if (bladeAllowed()) {
                    currentBladeState = BLADE_WORK;
                    digitalWrite(BLADE_UNIT_PIN, HIGH); // Pin 19 an
                    current_blade_pwm = BLADE_ZERO_US;
                    if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 6: Blade Unit ON (Pin 19 HIGH)");
                } else {
                    // Not allowed: enforce OFF
                    currentBladeState = BLADE_OFF;
                    digitalWrite(BLADE_UNIT_PIN, LOW);
                    current_blade_pwm = BLADE_ZERO_US;
                    if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 6: Blade ON blocked - blade is UP (safety)");
                }
            }
            // C: WEBSITE-ERKENNUNG (Neue stabile 20.000er Kennung)
            else if (key >= 21000 && key <= 22000) {
                if (bladeAllowed()) {
                    currentBladeState = BLADE_WORK;
                    // Rückrechnung: 21600 - 20000 = 1600 RPM
                    current_blade_pwm = key - 20000; 
                    if (ENABLE_DEBUG_SERIAL) debugPrintf("Skill 6: Web-PWM-> %d PWM\n", current_blade_pwm);
                } else {
                    currentBladeState = BLADE_OFF;
                    digitalWrite(BLADE_UNIT_PIN, LOW);
                    current_blade_pwm = BLADE_ZERO_US;
                    if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 6: Web-PWM blocked - blade is UP (safety)");
                }
            }
            // D: Geschwindigkeitsstufen (PS3 Controller R1 / R2)
            else if (key == 25600 || key == 2) { 
                if (bladeAllowed()) {
                    currentBladeState = BLADE_WORK;
                    current_blade_pwm = currentSettings.bladeWorkingSpeed;
                    if (ENABLE_DEBUG_SERIAL) debugPrintf("Skill 6: Blade Speed 1 -> %d PWM\n", current_blade_pwm);
                } else {
                    currentBladeState = BLADE_OFF;
                    digitalWrite(BLADE_UNIT_PIN, LOW);
                    current_blade_pwm = BLADE_ZERO_US;
                    if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 6: Blade Speed 1 blocked - blade is UP (safety)");
                }
            }
            else if (key == 26500 || key == 3) { 
                if (bladeAllowed()) {
                    currentBladeState = BLADE_WORK;
                    current_blade_pwm = currentSettings.bladeStage2Speed;
                    if (ENABLE_DEBUG_SERIAL) debugPrintf("Skill 6: Blade Speed 2 -> %d PWM\n", current_blade_pwm);
                } else {
                    currentBladeState = BLADE_OFF;
                    digitalWrite(BLADE_UNIT_PIN, LOW);
                    current_blade_pwm = BLADE_ZERO_US;
                    if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 6: Blade Speed 2 blocked - blade is UP (safety)");
                }
            }
        } 
        break; 
        // ---------------------------------------------------------------------
        // Skill 7: Max Speed and Steer setting
        // ---------------------------------------------------------------------
        case 7:
            if (param3 > 0) currentSettings.currentMaxSpeed = constrain(param3, 0, MAX_SPEED);
            if (param2 > 0) currentSettings.currentMaxSteer = constrain(param2, 0, MAX_STEER);
            saveSettings();
            if (ENABLE_DEBUG_SERIAL) {
                debugPrintf("Skill 7: Updated currentMaxSpeed to %d and currentMaxSteer to %d\n",
                              currentSettings.currentMaxSpeed, currentSettings.currentMaxSteer);
            }
            break;

        // ---------------------------------------------------------------------
        // Skill 8: Capsize Protection / Emergency Stop
        // ---------------------------------------------------------------------
        case 8:
            // ====================================================================================
            // ===== CHANGE START: Handling for setting capsize parameters via ESP-NOW ==========
            // ====================================================================================
            // This logic uses special "magic numbers" in the steer field to differentiate
            // between normal commands and setting parameters.
            if (param1 == 1000) { // Magic number for setting Angle
                currentSettings.capsizeAngle = (float)param2; // param2 holds the 'speed' field from ESP-NOW
                saveSettings();
                if (ENABLE_DEBUG_SERIAL) {
                    debugPrintf("Skill 8: Capsize Angle set to %.2f degrees.\n", currentSettings.capsizeAngle);
                }
                return; // Exit after setting parameter, do not continue with normal skill 8 logic
            }
            if (param1 == 1001) { // Magic number for setting Timeout
                currentSettings.capsizeTimeout = param2; // param2 holds the 'speed' field
                saveSettings();
                if (ENABLE_DEBUG_SERIAL) {
                    debugPrintf("Skill 8: Capsize Timeout set to %d ms.\n", currentSettings.capsizeTimeout);
                }
                return; // Exit after setting parameter
            }
            // ====================================================================================
            // ===== CHANGE END: End of ESP-NOW parameter setting logic =========================
            // ====================================================================================

            // This is the logic for skill 8 commands (E-Stop, Activate, Deactivate)
            if (param1 == 20) {
                // 1. Alle Skill-States löschen
                resetAll(); 

                // 2. HARDWARE NOT-AUS (Pin 19 & 20)
                digitalWrite(BLADE_UNIT_PIN, LOW);
                digitalWrite(DRIVE_UNIT_PIN, LOW);

