Dolomonti/ESP32s3-Lawnmower/src/main.cpp
                // 3. Klinge Software-Stop
                currentBladeState = BLADE_OFF;
                bladeEsc.writeMicroseconds(BLADE_ZERO_US);

                // 3. Activate the safety stop flag, which overrides motor commands in the main loop.
                skill8SafetyActive = true;
                static unsigned long lastEstopPrint = 0;
                unsigned long now = millis();
                if (ENABLE_DEBUG_SERIAL && (now - lastEstopPrint > 2000)) {
                    debugPrintln("--> IMMEDIATE EMERGENCY STOP TRIGGERED <--");
                    lastEstopPrint = now;
                }
            }
            else if (param1 > 0) {
                if (!skill8Active) {
                    resetAll();
                    skill8Active = true;
                    if (ENABLE_DEBUG_SERIAL) {
                        debugPrintln("Skill 8: Activated (Capsize MPU monitoring started).");
                    }
                }
            }
            // ====================================================================================
            // ===== CHANGE START: Updated "Stop/Reset" command logic =========================
            // ====================================================================================
            else if (param1 == -20) {
                // This is the "Stop/Reset" command from the remote/webpage.
                // It performs a targeted reset as requested, ending active skills,
                // resetting the gyro, and clearing any emergency stop state.
                if (ENABLE_DEBUG_SERIAL) {
                    debugPrintln("Stop/Reset command received: Stopping skills, resetting horizon, clearing E-Stop.");
                }

                // 1. Stop all active driving skills (like "Hold the Line").
                resetAll();

                // 2. Perform a horizon reset for the gyro.
                resetHorizon();

                // 3. Deactivate the emergency stop state, if active.
                if (skill8SafetyActive) {
                    skill8SafetyActive = false;
                    if (ENABLE_DEBUG_SERIAL) {
                        debugPrintln("--> Emergency Stop state has been cleared.");
                    }
                }
            }
            // ====================================================================================
            // ===== CHANGE END: End of "Stop/Reset" command logic update =======================
            // ====================================================================================
            else if (param1 < 0) {
                if (skill8Active) {
                    skill8Active = false;
                    hoverboardInverted = false;
                    skill8SafetyActive = false;
                    if (ENABLE_DEBUG_SERIAL) {
                        debugPrintln("Skill 8: Deactivated (Capsize MPU monitoring stopped).");
                    }
                }
            }
            else {
                debugPrintln("Skill 8: Undefined command, requires a non-zero value.");
            }
            break;

        // ---------------------------------------------------------------------
        // Skill 9: Reset ESP32 (device reset)
        // ---------------------------------------------------------------------
        case 9:
            if (ENABLE_DEBUG_SERIAL) {
                debugPrintln("Skill 9 triggered via Webpage. Restarting ESP32...");
            }
            ESP.restart();
            break;

        // ---------------------------------------------------------------------
        // Skill 10: Set Blade Speeds
        // ---------------------------------------------------------------------
        case 10:
            currentSettings.bladeWorkingSpeed = param1;
            currentSettings.bladeStage2Speed = param2;
            currentSettings.bladeMaxSpeed = param3;
            currentSettings.bladeCableResetRpm = param4;
            saveSettings();
            if (ENABLE_DEBUG_SERIAL) {
                debugPrintf("Skill 10: Blade speeds updated - Zero: %d, Working pwm: %d, 2 Stage pwm: %d, Max pwm: %d, Reset pwm: %d\n",
                              BLADE_ZERO_US, currentSettings.bladeWorkingSpeed, currentSettings.bladeStage2Speed, currentSettings.bladeMaxSpeed, currentSettings.bladeCableResetRpm);
            }
            break;

        // ---------------------------------------------------------------------
        // Skill 11: Blade Cable Length Reset
        // ---------------------------------------------------------------------
        case 11:
            if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 11: Reset triggered. Stopping blade and starting sequence...");

            // 1. Motor sofort auf Neutral (1500us) setzen, um laufende operationen zu unterbrechen
            current_blade_pwm = BLADE_ZERO_US; 
            bladeEsc.writeMicroseconds(BLADE_ZERO_US);

            // 2. Status auf CABLE_RESET setzen (dies erlaubt der runBladeLogic() zu übernehmen)
            currentBladeState = BLADE_CABLE_RESET;
            bladeSequenceStartTime = millis();

            // 3. Den PWM-Zielwert aktualisieren, falls ein neuer Wert mitgesendet wurde
            if (param1 > 1000) {
                currentSettings.bladeCableResetRpm = param1;
            }
            
            if (ENABLE_DEBUG_SERIAL) {
                debugPrintf("Skill 11: Blade Reset Sequence started. Target: %d PWM\n", currentSettings.bladeCableResetRpm);
            }
            break;

        // ---------------------------------------------------------------------
        // Skill 12: Apply Drive System Settings
        // ---------------------------------------------------------------------
        case 12:
            currentSettings.driveMinShutdownVoltage = param1;
            currentSettings.driveSafetyModeVoltage = param2;
            currentSettings.driveHighVoltage = param3;
            currentSettings.driveEmergencyLowTemp = param4;
            currentSettings.driveSafetyModeTemp = param5;
            currentSettings.driveHighTemp = param6;
            saveSettings();
            if (ENABLE_DEBUG_SERIAL) {
                debugPrintf("Skill 12: Drive settings updated - V: %d, %d, %d | Temp: %d, %d, %d\n",
                              currentSettings.driveMinShutdownVoltage, currentSettings.driveSafetyModeVoltage, currentSettings.driveHighVoltage,
                              currentSettings.driveEmergencyLowTemp, currentSettings.driveSafetyModeTemp, currentSettings.driveHighTemp);
            }
            break;

        // ---------------------------------------------------------------------
        // Skill 13: Apply Blade System Settings
        // ---------------------------------------------------------------------
        case 13:
            currentSettings.bladeMinShutdownVoltage = param1;
            currentSettings.bladeSafetyModeVoltage = param2;
            currentSettings.bladeHighVoltage = param3;
            currentSettings.bladeEmergencyLowTemp = param4;
            currentSettings.bladeSafetyModeTemp = param5;
            currentSettings.bladeHighTemp = param6;
            saveSettings();
            if (ENABLE_DEBUG_SERIAL) {
                debugPrintf("Skill 13: Blade settings updated - V: %d, %d, %d | Temp: %d, %d, %d\n",
                              currentSettings.bladeMinShutdownVoltage, currentSettings.bladeSafetyModeVoltage, currentSettings.bladeHighVoltage,
                              currentSettings.bladeEmergencyLowTemp, currentSettings.bladeSafetyModeTemp, currentSettings.bladeHighTemp);
            }
            break;
        
        // ====================================================================================
        // ===== CHANGE START: Added Skill 14 to set capsize parameters from Web UI =========
        // ====================================================================================
        // ---------------------------------------------------------------------
        // Skill 14: Set Capsize Parameters (from Web UI)
        // ---------------------------------------------------------------------
        case 14:
            currentSettings.capsizeAngle = (float)param1;
            currentSettings.capsizeTimeout = param2;
            saveSettings();
            if (ENABLE_DEBUG_SERIAL) {
                debugPrintf("Skill 14: Capsize parameters updated - Angle: %.2f, Timeout: %d\n",
                              currentSettings.capsizeAngle, currentSettings.capsizeTimeout);
            }
            break;
        // ====================================================================================
        // ===== NEU: Skill 15 zum Setzen der PD-Parameter ===================================
        // ====================================================================================
        case 15:
            // Wir erwarten, dass Kp und Kd als Float-Werte * 100 gesendet werden
            // z.B. Kp=4.5 wird als 450 gesendet.
            if (param1 > 0) currentSettings.Kp = (float)param1 / 100.0f;
            if (param2 > 0) currentSettings.Kd = (float)param2 / 100.0f;
            saveSettings();
            if (ENABLE_DEBUG_SERIAL) {
                debugPrintf("Skill 15: PD-Regler aktualisiert - Kp: %.2f, Kd: %.2f\n",
                              currentSettings.Kp, currentSettings.Kd);
            }
            break;
        // ====================================================================================
        // case 16 Blade Battery adjustment
        // ---------------------------------------------------------------------
        
