Dolomonti/ESP32s3-Lawnmower/src/main.cpp
            // Wir erwarten den Faktor * 100 (z.B. 2300 für 23.0), da wir ints senden
            case 16: 
                if (param1 > 0) {
                    currentSettings.bladeBatteryFactor = (float)param1 / 100.0;
                    saveSettings();
                    if (ENABLE_DEBUG_SERIAL) debugPrintf("Neuer Blade Batterie Faktor: %.2f\n", currentSettings.bladeBatteryFactor);
                }
                break;

        // ---------------------------------------------------------------------
        // Skill 17: Drive Battery adjustment over website or serial montior
        // ---------------------------------------------------------------------
        case 17: // Drive Battery adjustment
            if (param1 > 0) {
                currentSettings.driveBatteryFactor = (float)param1 / 1000.0; // /1000 für feinere Justierung
                saveSettings();
                debugPrintf("Neuer Drive Faktor: %.3f\n", currentSettings.driveBatteryFactor);
            }
            break;

        // ---------------------------------------------------------------------
        // Skill 18: Drive Battery pin on or off system
        // ---------------------------------------------------------------------

        case 18: // Drive Unit Power
            if (param1 > 0) {
                digitalWrite(DRIVE_UNIT_PIN, HIGH); // Pin 20 an
                if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 18: Drive Unit Power ON (Pin 20 HIGH)");
            } else {
                digitalWrite(DRIVE_UNIT_PIN, LOW);  // Pin 20 aus
                if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 18: Drive Unit Power OFF (Pin 20 LOW)");
            }
            break;
        // ---------------------------------------------------------------------
        // Skill 19: Set Hoverboard Parameters (Cmd, Accel, Brake)
        // ---------------------------------------------------------------------
        case 19:
            // Wir nutzen param1, param2, param3 für die neuen Werte
            global_cmdCode = (uint16_t)param1;
            global_accel   = (uint16_t)param2;
            global_brake   = (uint16_t)param3;
            
            if (ENABLE_DEBUG_SERIAL) {
                debugPrintf("Skill 19: Parameters updated -> Cmd: %d, Accel: %d, Brake: %d\n", 
                            global_cmdCode, global_accel, global_brake);
            }
            break;
        
        // ---------------------------------------------------------------------
        // Skill 20: Distance driving - REIN BINÄR
        // ---------------------------------------------------------------------
        case 20: 
        {
            resetMissionFlags = true;
            joystickSteer = 0; // NEU: Sicherstellen, dass Mission sauber startet
            joystickSpeed = 0; // NEU

            // Kickstart-Logik: Falls Distanz > 0, geben wir 100 Speed Impuls, falls < 0 geben wir -100
            // Das sorgt dafür, dass der STM32 sofort eine Bewegung registriert.
            lastEspNowSteer = (param1 > 0) ? 100 : (param1 < 0 ? -100 : 0);
            lastEspNowSpeed = (param2 > 0) ? 100 : (param2 < 0 ? -100 : 0);
            
            // Erst senden wir diesen kurzen Impuls (wird im nächsten controlLogicTask-Zyklus durch die echten cm ersetzt)
            global_cmdCode = 0; // Kurz im Speed-Modus anschieben
            Send(lastEspNowSteer, lastEspNowSpeed);
            vTaskDelay(pdMS_TO_TICKS(50)); // Nur 50ms Impuls

            if (ENABLE_DEBUG_SERIAL) {
                debugPrintf(">>> MISSION KICKSTARTED & SET: L:%d R:%d\n", param1, param2);
            }

            // Neue Distanzen sofort übernehmen
            lastEspNowSteer = param1; // Distanz Links (cm)
            lastEspNowSpeed = param2; // Distanz Rechts (cm)

            // Neue Limits und Rampen übernehmen (P3 bis P6)
            global_maxSpeedL = (param3 > 0) ? param3 : currentSettings.currentMaxSpeed;
            global_maxSpeedR = (param4 > 0) ? param4 : currentSettings.currentMaxSpeed;

            // Accel/Brake in % (20 = 20%)
            global_accel     = (uint16_t)constrain(param5, 0, 100); 
            global_brake     = (uint16_t)constrain(param6, 0, 100);

            // Mission starten
            global_cmdCode    = 2;    // Sagt dem STM32: "Lese Steer/Speed als Distanz"
            skill20StartTime  = millis(); 
            skillActive       = true; 
            currentSkill      = 20;

            if (ENABLE_DEBUG_SERIAL) {
                debugPrintf(">>> MISSION: L:%dcm R:%dcm | Spd L:%d R:%d | Acc:%d%% Brk:%d%%\n", 
                            param1, param2, global_maxSpeedL, global_maxSpeedR, global_accel, global_brake);
            }
        }
        break;

        } // Schließt den switch(skill) Block
}

// --- Die Send-Funktion passt sich dem cmdCode an ---
void Send(int16_t uSteer, int16_t uSpeed) {
    static unsigned long lastHeartbeatSend = 0;
    if (millis() - lastHeartbeatSend < 50) return; 
    lastHeartbeatSend = millis();

    if (isHighVoltageShutdown || skill8SafetyActive) {
        uSteer = 0; uSpeed = 0;
    }

    Command.start     = 0xABCD;
    Command.cmdCode   = (int16_t)global_cmdCode; 
    
    if (global_cmdCode == 2) {
        // MISSION: Sende die neu gesetzten Distanzen aus Skill 20
        Command.steer = lastEspNowSteer; 
        Command.speed = lastEspNowSpeed; 
    } else {
        // JOYSTICK: Sende normale Fahrwerte
        Command.steer = uSteer;
        Command.speed = uSpeed;
    }

    // Zuweisung aller Parameter für die binäre Übertragung
    Command.maxSpeedL = global_maxSpeedL;
    Command.maxSpeedR = global_maxSpeedR; // Sicherstellen, dass R auch gesendet wird
    Command.accPct    = (int16_t)global_accel; 
    Command.brkPct    = (int16_t)global_brake;

    // Checksumme muss exakt alle Felder der SerialCommand Struktur im STM32 spiegeln
    Command.checksum = Command.start ^ 
                       Command.cmdCode ^ 
                       Command.steer ^ 
                       Command.speed ^ 
                       Command.maxSpeedL ^ 
                       Command.maxSpeedR ^ 
                       Command.accPct ^ 
                       Command.brkPct;

    // Binäres Paket an den STM32 feuern
    HoverSerial.write((uint8_t *)&Command, sizeof(SerialCommand));
}



