Dolomonti/ESP32s3-Lawnmower/src/main.cpp
void Send(int16_t uSteer, int16_t uSpeed);

void sendESPNow(uint8_t *mac, ESPNowCommand *command) {
    esp_err_t result;

    // Set start frame
    command->start = START_FRAME;

    // Calculate checksum (excluding the checksum field itself)
    command->checksum = command->start ^ command->steer ^ command->speed ^ command->commandCode;

    // Acquire mutex only for the send operation
    if (xSemaphoreTake(espNowMutex, (TickType_t)20)) { // <-- VON portMAX_DELAY AUF 20 TICKS GEÄNDERT
        result = esp_now_send(mac, (uint8_t *)command, sizeof(ESPNowCommand));
        xSemaphoreGive(espNowMutex);
    } else {
        // Dies ist jetzt kein fataler Fehler mehr, sondern ein erwarteter Timeout, 
        // wenn der Receive-Callback den Mutex gerade hält. Wir verwerfen einfach diesen einen Heartbeat.
        // debugPrintln("WARN: Mutex timeout in sendESPNow, dropping packet."); // Optionales Debugging
        return;
    }

    if (result != ESP_OK) {
      debugPrintf("ESP-NOW send failed with error: %d\n", result);
    }
}


//////////////////////////////ESP_NOW HANDLING//////////////////////////////////////////////////
// KORRIGIERTE FUNKTION: Fügt Mutex-Schutz für peers[] Array hinzu
// ====================================================================================
// ===== FIX: Robuste onDataReceive Funktion für Receiver (Gehärtet) ==================
// ====================================================================================
void onDataReceive(const uint8_t *mac_addr, const uint8_t *incomingData, int len) {
    
    // 1. Sichere lokale Kopie anlegen (WICHTIG für Speicher-Alignment)
    ESPNowCommand cmd;

    // 2. Längen-Check
    if (len != sizeof(ESPNowCommand)) {
        // debugPrintf("ESP-NOW Error: Wrong Length. Recv=%d, Expected=%d\n", len, sizeof(ESPNowCommand));
        return; 
    }

    // 3. Daten kopieren (Sicherer als Pointer-Casting)
    memcpy(&cmd, incomingData, sizeof(cmd));

    // 4. Start-Frame Check
    if (cmd.start != START_FRAME) {
        // debugPrintf("ESP-NOW Error: Invalid Start Frame. Recv=0x%04X\n", cmd.start);
        return;
    }

    // 5. Checksummen-Berechnung (STRIKTES Casting auf uint16_t)
    uint16_t calculatedChecksum = cmd.start ^ (uint16_t)cmd.steer ^ (uint16_t)cmd.speed ^ (uint16_t)cmd.commandCode;

    if (calculatedChecksum != cmd.checksum) {
        debugPrintf("INVALID FRAME: calc=0x%04X recv=0x%04X\n", calculatedChecksum, cmd.checksum);
        return; // <--- GANZ WICHTIG: Hier sofort abbrechen!
    }

    // --- Peer Handling (Mutex geschützt) ---
    int senderIndex = -1; 
    if (xSemaphoreTake(espNowMutex, (TickType_t)20) == pdTRUE) {
        for (int i = 0; i < numberOfPeers; i++) {
            if (memcmp(mac_addr, deviceList[i].mac, 6) == 0) {
                senderIndex = i; 
                if (!peers[senderIndex].isConnected) {
                    peers[senderIndex].isConnected = true;
                    peers[senderIndex].reconnectAttempts = 0;
                    if (ENABLE_DEBUG_SERIAL) debugPrintf("Peer %d connected via ESP-NOW.\n", deviceList[senderIndex].id);
                }
                peers[senderIndex].lastSeen = millis();
                break;           
            }
        } 
        xSemaphoreGive(espNowMutex);
    } else {
        return; // Mutex Timeout
    }

    if (senderIndex == -1) return; // Unbekannter Sender

    // --- Befehlsverarbeitung (Mit Punkt-Operator . statt Pfeil ->) ---
    switch (cmd.commandCode) {
        case 0:  // Fahrbefehl
            lastEspNowSteer = cmd.steer;
            lastEspNowSpeed = cmd.speed;
            joystickSteer = cmd.steer;   // NEU: Separater Speicher für Override-Check
            joystickSpeed = cmd.speed;   // NEU
            lastJoystickCommandTime = millis();
            break;
            
        case 255: // Heartbeat
            break;

        default: // Alle Skills (1-17, etc.)
            if (ENABLE_DEBUG_SERIAL) {
                // Debug Ausgabe
                debugPrintf("Skill CMD %d Recv -> Steer(Param1): %d, Speed(Param2): %d\n", cmd.commandCode, cmd.steer, cmd.speed);
            }
            triggerSkill(cmd.commandCode, cmd.steer, cmd.speed);
            break;
    }
}

TaskHandle_t heartbeatTaskHandle = NULL;

void heartbeatTask(void *parameter) {
    // Erstelle ein wiederverwendbares Heartbeat-Befehlspaket.
    ESPNowCommand heartbeatCmd;
    heartbeatCmd.commandCode = 255; // 255 ist der designierte Heartbeat-Code.
    heartbeatCmd.steer = 0;
    heartbeatCmd.speed = 0;
    // Die sendESPNow-Funktion fügt automatisch den START_FRAME und die Checksum hinzu.

    while (true) {
        // 1. Prüfe auf Timeouts von anderen Peers (dies erledigt managePeers).
        managePeers();

        // 2. Sende unseren eigenen Heartbeat an alle registrierten Peers,
        //    um zu zeigen, dass wir noch aktiv sind.
        //    Dies löst das Problem, dass die Remote dieses Gerät als offline markiert.
        for (int i = 0; i < numberOfPeers; i++) {
        if (deviceList[i].id != deviceID) { 
            // Nur senden, wenn wir von diesem Peer länger als 2 Sek. nichts gehört haben
            if (millis() - peers[i].lastSeen > 2000) {
                sendESPNow(deviceList[i].mac, &heartbeatCmd);
                vTaskDelay(pdMS_TO_TICKS(15)); // Etwas mehr Zeit für den Funkkanal
            }
        }
        }

        // 3. Warte auf das nächste Intervall.
        vTaskDelay(HEARTBEAT_INTERVAL / portTICK_PERIOD_MS);
    }
}
    

// Helper function to check if a string is a valid integer
bool isValidInteger(String str) {
    str.trim();
    if (str.length() == 0) return false;
    for (unsigned int i = 0; i < str.length(); i++) {
        if (i == 0 && (str.charAt(i) == '-' || str.charAt(i) == '+')) {
            if (str.length() == 1) return false; // Only sign, no digits
            else continue;
        }
        if (!isDigit(str.charAt(i))) return false;
    }
    return true;
}

void handleSerialInput() {
    static String inputString = "";     // A static variable to hold the incoming data
    static bool stringComplete = false; // A flag to indicate when a full line has been received

    // 1. Daten einlesen
    while (Serial.available()) {
        char inChar = (char)Serial.read();
        if (inChar == '\n') {
            stringComplete = true;
        } else if (inChar != '\r') {
            inputString += inChar;
        }
    }

