Dolomonti/ESP32s3-Lawnmower/src/main.cpp
    // Wir aktualisieren hier nur noch die Variablen für die Web-Anzeige
    button1State = !digitalRead(BUTTON1_PIN);
    button2State = !digitalRead(BUTTON2_PIN);
    // 8. Web Log Timer (Log-Daten an Website schicken alle 500ms)
        if (webLogActive && (millis() - lastWebLogSend > 500)) {        lastWebLogSend = millis();
        if (webLogBuffer.length() > 0) {
            ws.textAll("LOG:" + webLogBuffer); 
            webLogBuffer = ""; 
        }
    }

    // 9. Mähwerk-Logik (Blade)
    runBladeLogic();

    ArduinoOTA.handle(); // Prüft ständig, ob ein neues Update über WLAN reinkommt

    // 10. Kurze Pause für Hintergrundprozesse
    vTaskDelay(10 / portTICK_PERIOD_MS);
}

void mpuReadTask(void *parameter) {
  if (ENABLE_DEBUG_SERIAL) debugPrintln("MPU Reading Task (Core 0) started.");
  
  for (;;) {
    // Erhöhter Timeout für Semaphore, um auf ISR zu warten
    if (xSemaphoreTake(mpuSemaphore, pdMS_TO_TICKS(100)) == pdTRUE) {
      if (xSemaphoreTake(i2cMutex, pdMS_TO_TICKS(10)) == pdTRUE) {
        
        fifoCount = mpu.getFIFOCount();
        
        // Wenn der Puffer zu voll wird (> 500 Bytes), ist er "veraltet". 
        // Wir löschen ihn komplett für frische Daten.
        if (fifoCount == 1024 || fifoCount > 500) {
          mpu.resetFIFO();
        } 
        else {
          // Wir lesen nur das aktuellste Paket und verwerfen den Rest im Puffer schnell,
          // um Latenz zu vermeiden (Real-Time Orientierung).
          while (fifoCount >= packetSize) {
            mpu.getFIFOBytes(fifoBuffer, packetSize);
            fifoCount -= packetSize;
          }

          // Nur das letzte (aktuellste) Paket verarbeiten
          mpu.dmpGetQuaternion(&q, fifoBuffer);
          mpu.dmpGetGravity(&gravity, &q);
          mpu.dmpGetYawPitchRoll(ypr, &q, &gravity);

          yaw   = 2.0f * ((ypr[0] * 180 / M_PI) - yawOffset);
          pitch = (ypr[1] * 180 / M_PI) - pitchOffset;
          roll  = (ypr[2] * 180 / M_PI) - rollOffset;

          if (yaw > 180)  yaw -= 360;
          if (yaw < -180) yaw += 360;

          if (skill8Active) {
              monitorSkill8Angles(pitch, roll);
              if (monitorDirection) monitorDirectionChange(yaw);
              if (holdLine && (millis() - case3StartTime >= 500)) holdTheLine(yaw);
          }
        }
        xSemaphoreGive(i2cMutex);
      }
    }
    // Task-Delay reduzieren für schnellere Reaktion (Core 0 hat Zeit)
    vTaskDelay(pdMS_TO_TICKS(5)); 
  } 
}


// ========================================================
void handleSystemStatus(int16_t battery, int16_t temp, int16_t battery_temp, int16_t blade_battery, int16_t blade_temp, int16_t blade_battery_temp) {
    
    static unsigned long driveHighVoltTime = 0;
    static unsigned long driveLowVoltTime = 0;
    static unsigned long driveTempErrorTime = 0;
    static unsigned long bladeVoltErrorTime = 0;

    unsigned long now = millis();

    // 1. DRIVE SYSTEM MONITORING (Hoverboard)
    if (battery > 0) {
        // A. Überspannung Drive
        if (battery > currentSettings.driveHighVoltage) {
            if (driveHighVoltTime == 0) driveHighVoltTime = now;
            if (now - driveHighVoltTime > SAFETY_TRIGGER_DELAY && !isHighVoltageShutdown) {
                isHighVoltageShutdown = true;
                highVoltageStopTime = now;
                debugPrintln("!!! SHUTDOWN: Drive High Voltage (Persistent)!");
                triggerSkill(8, 20);
            }
        } else { driveHighVoltTime = 0; }

        // B. Kritische Unterspannung Drive
        if (battery < currentSettings.driveMinShutdownVoltage) {
            if (driveLowVoltTime == 0) driveLowVoltTime = now;
            if (now - driveLowVoltTime > SAFETY_TRIGGER_DELAY) {
                Send(0, 0);
                debugPrintln("!!! STOP: Drive Battery Critically Low!");
            }
        } else { driveLowVoltTime = 0; }

        // C. Safety Mode (Warnung/Drosselung - ohne Delay für sofortige Reaktion)
        if (battery < currentSettings.driveSafetyModeVoltage && battery >= currentSettings.driveMinShutdownVoltage) {
            if (!isInSafetyMode) {
                isInSafetyMode = true;
                originalMaxSpeed = currentSettings.currentMaxSpeed;
                currentSettings.currentMaxSpeed /= 2;
                triggerSkill(6, -1);
                debugPrintln("!! SAFETY MODE: Low Drive Battery - Blade OFF");
            }
        } else if (battery >= currentSettings.driveSafetyModeVoltage && isInSafetyMode) {
            // Automatischer Reset des Safety Modes, wenn Spannung wieder OK
            isInSafetyMode = false;
            currentSettings.currentMaxSpeed = originalMaxSpeed;
            debugPrintln("SYSTEM: Drive Voltage restored. Normal speed.");
        }
    }

    // 2. DRIVE TEMPERATURE CHECK
    if (temp > -100) { 
        if (temp > currentSettings.driveHighTemp || (temp != 0 && temp < currentSettings.driveEmergencyLowTemp)) {
            if (driveTempErrorTime == 0) driveTempErrorTime = now;
            if (now - driveTempErrorTime > SAFETY_TRIGGER_DELAY) {
                debugPrintf("!!! SHUTDOWN: Drive Temp Error Persistent: %d\n", temp);
                triggerSkill(8, 20);
            }
        } else { driveTempErrorTime = 0; }
    }

    // 3. BLADE SYSTEM MONITORING (Zusatz-Akku) - Integriert in handleSystemStatus
    if (global_blade_voltage_mv > 5000) { 
        int32_t minLimitMv = (int32_t)currentSettings.bladeMinShutdownVoltage * 10;
        int32_t maxLimitMv = (int32_t)currentSettings.bladeHighVoltage * 10;

        if (global_blade_voltage_mv < minLimitMv || global_blade_voltage_mv > maxLimitMv) {
            if (bladeVoltErrorTime == 0) bladeVoltErrorTime = now;
            if (now - bladeVoltErrorTime > SAFETY_TRIGGER_DELAY && currentBladeState != BLADE_OFF) {
                debugPrintf("!!! BLADE STOP: Voltage %d mV Persistent Error! Relay OFF.\n", global_blade_voltage_mv);
                triggerSkill(6, -1);
            }
        } else { bladeVoltErrorTime = 0; }
    }
}

void resetHorizon() {
    yawOffset = ypr[0] * 180 / M_PI;
    pitchOffset = ypr[1] * 180 / M_PI;
    rollOffset = ypr[2] * 180 / M_PI;
    // ====================================================================================
    // ===== CHANGE START: Added capsize timer reset to horizon calibration =============
    // ====================================================================================
    capsizeDetectTime = 0; // Also reset the capsize detection timer to prevent false triggers after reset
    // ====================================================================================
    // ===== CHANGE END: End of timer reset =============================================
    // ====================================================================================
    if (ENABLE_DEBUG_SERIAL) {
      debugPrintln("Horizon reset: All angles set to 0°.");
    }
}

void resetAll() {
    currentCase = 0;
    monitorDirection = false;
    holdLine = false;
    holdPosition = false;
    turnDirection = 0;
    skillActive = false;
    currentSkill = 0;
    skillSteer = 0;
    lastEspNowSpeed = 0;
    lastEspNowSteer = 0;
    cumulativeYaw = 0;
    capsizeDetectTime = 0;
    lastError = 0.0f;
    lastPdTime = 0;

    // Blade Unit auf Stand-by (1500)
    digitalWrite(BLADE_UNIT_PIN, HIGH); 
    currentBladeState = BLADE_WORK;
    current_blade_pwm = BLADE_ZERO_US;

    if (ENABLE_DEBUG_SERIAL) {
      debugPrintln("System reset: All states cleared.");
    }
}


// ÄNDERN Sie die Funktion "monitorDirectionChange"
void monitorDirectionChange(float yaw) {
    float rectangleError = fmod(targetAngle - yaw + 540, 360) - 180;

    // Fix für 180-Grad-Drehung
    if (turnDirection == 1 && rectangleError < -90) rectangleError += 360;
    else if (turnDirection == -1 && rectangleError > 90) rectangleError -= 360;

    // ===== NEUE PD-REGLER-LOGIK START =====
    unsigned long now = millis();
    unsigned long rectangleTimeDelta = now - lastPdTime;

    // Verhindere Division durch Null beim ersten Durchlauf
    if (lastPdTime == 0 || rectangleTimeDelta == 0) {
        rectangleTimeDelta = 1; // Setze auf einen kleinen Wert
    }

